---
type: MechanicalEquipmentSetType
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 2
tags: [revit-api, class]
---

# MechanicalEquipmentSetType

`Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2019 | `public static MechanicalEquipmentSetType Create ( Document document , string name )` |
| Property | Parameter | — | `` |